#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mdata.aws_vpc.selected: Reading...[0m[0m
[0m[1mdata.aws_ami.aws_ubuntu: Reading...[0m[0m
[0m[1mdata.aws_ami.ubuntu: Reading...[0m[0m
[0m[1mdata.aws_ami.aws_ubuntu: Read complete after 0s [id=ami-079b3eb380b97ef7a][0m
[0m[1mdata.aws_ami.ubuntu: Read complete after 1s [id=ami-04b107e90218672e5][0m
[0m[1mdata.aws_vpc.selected: Read complete after 1s [id=vpc-04adbc006871eed44][0m
[0m[1maws_security_group.shared_web: Refreshing state... [id=sg-017c29e692d712728][0m
[0m[1maws_instance.shared_kaotik: Refreshing state... [id=i-0bf392746cda4cb18][0m
[0m[1maws_eip.shared_kaotik: Refreshing state... [id=eipalloc-0d5355c313bdd3ba5][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # aws_instance.shared_kaotik[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "aws_instance" "shared_kaotik" {
        [1m[0mid[0m[0m                                   = "i-0bf392746cda4cb18"
      [33m~[0m [0m[1m[0mpublic_dns[0m[0m                           = "ec2-54-198-109-9.compute-1.amazonaws.com" [33m->[0m [0m"ec2-44-197-225-55.compute-1.amazonaws.com"
        [1m[0mtags[0m[0m                                 = {
            "Terraform" = "true"
        }
        [90m# (32 unchanged attributes hidden)[0m[0m

        [90m# (8 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_eip.shared_kaotik[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_eip" "shared_kaotik" {
        [1m[0mid[0m[0m                   = "eipalloc-0d5355c313bdd3ba5"
      [33m~[0m [0m[1m[0minstance[0m[0m             = "i-0bf392746cda4cb18" [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m                 = {}
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_instance.shared_kaotik[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_instance" "shared_kaotik" {
      [33m~[0m [0m[1m[0mami[0m[0m                                  = "ami-052efd3df9dad4825" [33m->[0m [0m"ami-04b107e90218672e5" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0marn[0m[0m                                  = "arn:aws:ec2:us-east-1:294287152212:instance/i-0bf392746cda4cb18" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0massociate_public_ip_address[0m[0m          = true [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mavailability_zone[0m[0m                    = "us-east-1b" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcpu_core_count[0m[0m                       = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcpu_threads_per_core[0m[0m                 = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdisable_api_stop[0m[0m                     = false [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdisable_api_termination[0m[0m              = false [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mebs_optimized[0m[0m                        = false [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mhibernation[0m[0m                          = false [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0mhost_id[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mhost_resource_group_arn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0miam_instance_profile[0m[0m                 = (known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                                   = "i-0bf392746cda4cb18" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_initiated_shutdown_behavior[0m[0m = "stop" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0minstance_lifecycle[0m[0m                   = (known after apply)
      [33m~[0m [0m[1m[0minstance_state[0m[0m                       = "running" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_address_count[0m[0m                   = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_addresses[0m[0m                       = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mmonitoring[0m[0m                           = false [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m                      = (known after apply)
      [33m~[0m [0m[1m[0mplacement_partition_number[0m[0m           = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprimary_network_interface_id[0m[0m         = "eni-047667585d3a22596" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_dns[0m[0m                          = "ip-172-31-30-243.ec2.internal" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip[0m[0m                           = "172.31.30.243" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpublic_dns[0m[0m                           = "ec2-44-197-225-55.compute-1.amazonaws.com" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpublic_ip[0m[0m                            = "44.197.225.55" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msecondary_private_ips[0m[0m                = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msecurity_groups[0m[0m                      = [
          [31m-[0m [0m"default",
        ] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mspot_instance_request_id[0m[0m             = (known after apply)
      [33m~[0m [0m[1m[0msubnet_id[0m[0m                            = "subnet-042e35b2c0f85e2b7" [33m->[0m [0m(known after apply)
        [1m[0mtags[0m[0m                                 = {
            "Terraform" = "true"
        }
      [33m~[0m [0m[1m[0mtenancy[0m[0m                              = "default" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0muser_data_base64[0m[0m                     = (known after apply)
      [33m~[0m [0m[1m[0mvpc_security_group_ids[0m[0m               = [
          [31m-[0m [0m"sg-05ccd624046be748b",
        ] [33m->[0m [0m(known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mcapacity_reservation_specification {
          [33m~[0m [0m[1m[0mcapacity_reservation_preference[0m[0m = "open" [33m->[0m [0m(known after apply)

          [32m+[0m [0mcapacity_reservation_target {
              [32m+[0m [0m[1m[0mcapacity_reservation_id[0m[0m                 = (known after apply)
              [32m+[0m [0m[1m[0mcapacity_reservation_resource_group_arn[0m[0m = (known after apply)
            }
        }

      [33m~[0m [0mcpu_options {
          [32m+[0m [0m[1m[0mamd_sev_snp[0m[0m      = (known after apply)
          [33m~[0m [0m[1m[0mcore_count[0m[0m       = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mthreads_per_core[0m[0m = 1 [33m->[0m [0m(known after apply)
        }

      [31m-[0m [0mcredit_specification {
          [31m-[0m [0m[1m[0mcpu_credits[0m[0m = "standard" [90m->[0m [0m[90mnull[0m[0m
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [33m~[0m [0menclave_options {
          [33m~[0m [0m[1m[0menabled[0m[0m = false [33m->[0m [0m(known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [32m+[0m [0minstance_market_options {
          [32m+[0m [0m[1m[0mmarket_type[0m[0m = (known after apply)

          [32m+[0m [0mspot_options {
              [32m+[0m [0m[1m[0minstance_interruption_behavior[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmax_price[0m[0m                      = (known after apply)
              [32m+[0m [0m[1m[0mspot_instance_type[0m[0m             = (known after apply)
              [32m+[0m [0m[1m[0mvalid_until[0m[0m                    = (known after apply)
            }
        }

      [33m~[0m [0mmaintenance_options {
          [33m~[0m [0m[1m[0mauto_recovery[0m[0m = "default" [33m->[0m [0m(known after apply)
        }

      [33m~[0m [0mmetadata_options {
          [33m~[0m [0m[1m[0mhttp_endpoint[0m[0m               = "enabled" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhttp_protocol_ipv6[0m[0m          = "disabled" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhttp_tokens[0m[0m                 = "optional" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0minstance_metadata_tags[0m[0m      = "disabled" [33m->[0m [0m(known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_card_index[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [33m~[0m [0mprivate_dns_name_options {
          [33m~[0m [0m[1m[0menable_resource_name_dns_a_record[0m[0m    = false [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0menable_resource_name_dns_aaaa_record[0m[0m = false [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhostname_type[0m[0m                        = "ip-name" [33m->[0m [0m(known after apply)
        }

      [33m~[0m [0mroot_block_device {
          [33m~[0m [0m[1m[0mdelete_on_termination[0m[0m = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdevice_name[0m[0m           = "/dev/sda1" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mencrypted[0m[0m             = false [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0miops[0m[0m                  = 100 [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [33m~[0m [0m[1m[0mtags[0m[0m                  = {} [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mthroughput[0m[0m            = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mvolume_id[0m[0m             = "vol-0bae36a3f41cc0a90" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mvolume_size[0m[0m           = 8 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mvolume_type[0m[0m           = "gp2" [33m->[0m [0m(known after apply)
        }
    }

[1m  # aws_security_group.shared_web[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "shared_web" {
      [33m~[0m [0m[1m[0marn[0m[0m                    = "arn:aws:ec2:us-east-1:294287152212:security-group/sg-017c29e692d712728" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mdescription[0m[0m            = "allow ssh on 22 & http/s on port 80/443" [33m->[0m [0m"allow ssh on 22 + http/https on port 80/443" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m                     = "sg-017c29e692d712728" [33m->[0m [0m(known after apply)
        [1m[0mname[0m[0m                   = "shared_web"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m            = (known after apply)
      [33m~[0m [0m[1m[0mowner_id[0m[0m               = "294287152212" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                   = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_all[0m[0m               = {} [33m->[0m [0m(known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 2 to add, 1 to change, 2 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0maws_instance_private_ip[0m[0m = "172.31.30.243" [33m->[0m [0m(known after apply)
  [33m~[0m [0m[1m[0maws_instance_public_dns[0m[0m = "ec2-54-198-109-9.compute-1.amazonaws.com" [33m->[0m [0m(known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>